Revit 2027 API
EnergyAnalysisSurface.SurfaceType Property
Note: This API is now obsolete.
 The analytical surface type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the Type property instead.")]
public EnergyAnalysisSurfaceType SurfaceType { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the Type property instead.")>
Public ReadOnly Property SurfaceType As EnergyAnalysisSurfaceType
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the Type property instead.")]
property EnergyAnalysisSurfaceType SurfaceType {
	EnergyAnalysisSurfaceType get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the Type property instead.")>]
member SurfaceType : EnergyAnalysisSurfaceType with get
Property Value
EnergyAnalysisSurfaceType
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace